![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 10.2 Reordering and Sorting Levels

First we import numpy and pandas libraries:

In [1]:
import numpy as np
import pandas as pd

Here we create a multi-index dataframe, similar tot he last lecture:

In [2]:
data = pd.DataFrame(np.random.randint(100, size = (6,4)),
                    index = [['green', 'green', 'black','black','yellow', 'yellow'],
                             ['one', 'two','one','two','one','two']])
data

             0   1   2   3
green  one  41  11  39  76
       two  96  94  72  89
black  one  77  31  45  71
       two   8  43  60  18
yellow one  11  84  31  36
       two  64  38  90  53

We can swap the index levels by using the function **swaplevel()**:

In [3]:
data2 = data.swaplevel(0,1)
data2

             0   1   2   3
one green   41  11  39  76
two green   96  94  72  89
one black   77  31  45  71
two black    8  43  60  18
one yellow  11  84  31  36
two yellow  64  38  90  53

After swapping the index levels, we can sort the index using the function **sort_index()**:

In [4]:
data2.sort_index(level=0)

             0   1   2   3
one black   77  31  45  71
    green   41  11  39  76
    yellow  11  84  31  36
two black    8  43  60  18
    green   96  94  72  89
    yellow  64  38  90  53

We can do the last two steps in a single code line like this:

In [5]:
data.swaplevel(0,1).sort_index(level=0)

             0   1   2   3
one black   77  31  45  71
    green   41  11  39  76
    yellow  11  84  31  36
two black    8  43  60  18
    green   96  94  72  89
    yellow  64  38  90  53

***

<h1 align="center">Thank You</h1> 

***